<template>
    <NuxtLayout name="default">
        <div class="box">
            <div class="title" >服務條款與使用者權益</div>
            <div class="collapse">
                阿普蛙工作室（以下簡稱本工作室）係依據本服務條款提供本站各項服務。當您註冊完成或開始使用本服務時，即表示您已閱讀、了解並同意接受本服務條款之所有內容。如果您不同意本服務條款的內容，或者您所屬的國家或地域排除本服務條款內容之全部或部分時，您應立即停止使用本服務。本工作室有權於任何時間修改或變更本服務條款之內容，並公告於本服務網站上，請您隨時注意該等修改或變更。若您於任何修改或變更後繼續使用本服務，則視為您已閱讀、了解並同意接受該等修改或變更。

                若您為未滿二十歲之未成年人，則應請您的父母或監護人閱讀、了解並同意本服務條款之所有內容及其後之修改變更，方得使用本服務。當您使用本服務時，即推定您的父母或監護人已閱讀、了解並同意接受本服務條款之所有內容及其後之修改變更。

            </div>
            <div class="collapse">
                <el-collapse v-model="activeNames" @change="handleChange">
                    <el-collapse-item title="一、隱私權保護政策" name="1">
                        <div>
                            本工作室相當重視隱私權的保護。關於您的會員註冊以及其他特定資料，將依本服務「隱私權政策」保護與規範。您了解並同意當您使用本服務時，本服務可依據「隱私權政策」之規範進行您個人資料的蒐集與利用。
                        </div>
                    </el-collapse-item>
                    <el-collapse-item title="二、一般條款" name="2">
                        <div>
                            本服務條款構成您與本工作室就您使用本服務之完整合意，取代您先前與本工作室間有關本服務所為之任何約定。本服務條款之解釋與適用，以及與本服務條款有關的爭議，除法律另有規定者外，均應依照中華民國法律予以處理，並以台灣台北地方法院為管轄法院。
                            本工作室未行使或執行本服務條款任何權利或規定，不構成前開權利或規定之棄權。若任何本服務條款規定，經有管轄權之法院認定無效，當事人仍同意法院應努力使當事人於前開規定所表達之真意生效，且本服務條款之其他規定仍應完全有效。
                        </div>
                    </el-collapse-item>
                    <el-collapse-item title="三、會員的註冊義務及會員帳號、密碼安全" name="3">
                        <div>
                            為了能使用本服務，您同意並承諾以下事項：
                            <ul>
                                <li>依本服務註冊流程之提示提供您本人正確及完整的資料。</li>
                                <li>若您提供任何不完整、錯誤或不實的資料，本工作室有權暫停或終止您的帳號，並拒絕您使用本服務之全部或部分。</li>
                            </ul>
                            完成本服務的註冊流程後，您同意並承諾以下事項：
                            <ul>
                                <li>此帳號係不可轉讓。</li>
                                <li>您有責任維持此帳號及密碼的機密安全。</li>
                                <li>當您的帳號遭到盜用或有其他任何安全問題發生時，您將立即通知本工作室。</li>
                            </ul>
                        </div>
                    </el-collapse-item>
                    <el-collapse-item title="四、會員使用規範與義務" name="4">
                        <div>
                            除了遵守本服務條款之約定外，您同意遵守中華民國相關法規、本服務其他服務條款，並同意不從事以下行為：
                            您若係中華民國以外之使用者，並同意遵守所屬國家或地域之相關法規。您同意並保證絕不利用本服務從事違法或損害他人權益之行為。
                            <ul>
                                <li>冒用他人名義使用本服務。</li>
                                <li>侵害他人名譽、隱私權、著作權、智慧財產權及其他權利。</li>
                                <li>違反依法律或契約所應負之保密義務。</li>
                                <li>上載、張貼或公佈任何含有電腦木馬、病毒或任何對電腦軟、硬體產生中斷、破壞或限制功能之程式碼或資料。</li>
                                <li>破壞及干擾本服務所提供之各項資料、活動或功能，或以任何方式侵入、試圖侵入、破壞本服務之任何系統，或藉由本服務為任何侵害或破壞行為。</li>
                                <li>其他本工作室有正當理由認為不適當之行為。</li>
                            </ul>
                            若您有違反前開事項之情事或之虞，本工作室有權於通知或未通知之情形下，隨時終止或限制您使用帳號（或其任何部分）或本服務之使用，並將本服務內任何相關「會員內容」加以移除並刪除。您同意若本服務之使用被終止或限制時，本工作室對您或任何第三人均不承擔責任。
                        </div>
                    </el-collapse-item>
                    <el-collapse-item title="五、對本服務的貢獻" name="5">
                        <div>
                            若您對於本服務提供任何想法、建議或提議（以下稱「貢獻」）並回饋給本工作室，您了解並同意：
                            <ul>
                                <li>該貢獻並非特定機密或專有資訊，且不侵害他人名譽、隱私權、著作權、智慧財產權及其他權利。</li>
                                <li>本工作室對該貢獻並不負有任何明示或默示的保密責任。</li>
                                <li>本工作室可能已有與該貢獻相似而正在考慮或發展中的想法或提案。</li>
                                <li>本工作室可以基於公益或為宣傳、推廣本服務之目的，以任何方式、在任何媒體上使用（或選擇不使用）該貢獻。</li>
                                <li>該貢獻將於本工作室不對您負任何責任的情形下，自動成為本工作室之財產。您於任何情形下皆無權利對本工作室主張任何形式的賠償或補償。</li>
                            </ul>
                        </div>
                    </el-collapse-item>
                    <el-collapse-item title="六、不得為商業使用" name="6">
                        您同意並承諾不對本服務提供之系統（不限於會員內容、會員帳號）、軟體使用或存取，進行任何商業目的之使用。
                    </el-collapse-item>
                    <el-collapse-item title="七、您對本服務之授權" name="7">
                        若您無合法權利得授權他人使用、修改、發行、散布、重製或公開展示某資料，並將前述權利轉授權第三人，請勿擅自將該資料上載、輸入或提供予本服務。您所上載、輸入或提供予本服務之任何資料，其權利仍為您或您的授權人所有；但任何資料一經您上載、輸入或提供予本服務時，即表示您已同意授權本工作室可以基於公益或為宣傳、推廣本服務之目的，進行使用、修改、發行、散布、重製或公開展示該等資料，並得在此範圍內將前述權利轉授權他人。您並保證本服務使用、修改、發行、散布、重製、公開展示或轉授權該資料，不致侵害任何第三人之相關權利，否則應對本工作室負損害賠償責任。
                    </el-collapse-item>
                    <el-collapse-item title="八、系統中斷或故障" name="8">
                        本服務有時可能會出現中斷或故障等現象，或許將造成您使用上的不便、資料喪失、錯誤等情形。您於使用本服務時宜自行採取防護措施。本工作室對於您因使用（或無法使用）本服務而造成的損害，不負任何賠償責任。
                    </el-collapse-item>
                    <el-collapse-item title="九、與第三方網站之連結及第三方提供之內容" name="9">
                        本服務可能會提供連結至其他網站。第三方之網站均由各該機關單位自行負責，不屬本服務控制及負責範圍之內。
                    </el-collapse-item>
                    <el-collapse-item title="十、服務變更及通知" name="10">
                        您同意本工作室保留於任何時間點，不經通知隨時修改、暫時或永久停止繼續提供本服務（或其任一部分）的權利。如依法或其他相關規定須為通知時，本服務得以包括但不限於：張貼於本服務網頁、電子郵件，或其他現在或未來合理之方式通知您，包括本服務條款之變更。但若您違反本服務條款，以未經授權的方式存取本服務，或於註冊時所提供之資料不正確或未更新，您將不會收到前述通知。當您經由授權的方式存取本服務，您即同意本服務所為之任何及所有給您的通知，均視為送達。
                    </el-collapse-item>
                    <el-collapse-item title="十一、智慧財產權的保護" name="11">
                        本服務所使用之程式、軟體及網站內容，包括但不限於：資訊、資料、圖片、檔案、網站架構、網頁設計及會員內容等，均由本工作室或其他權利人依法擁有其智慧財產權，包括但不限於專利權、著作權與專有技術等。任何人不得逕自修改、重製、散布、發行、公開發表、進行還原工程或反向組譯。若您欲引用或轉載前述資料，除明確為法律所允許者外，均須依法事前取得本工作室或其他權利人之書面同意。如有違反，您應負損害賠償責任。
                    </el-collapse-item>
                    <el-collapse-item title="十二、商品內容及退費" name="12">
                        本服務不提供實體商品，教材所需的資料及檔案皆可自網站上使用或下載。
                        <ul>
                            <li>於網站購買本教材後，將於電子信箱獲得註冊碼，於註冊後輸入即可開始使用本服務。</li>
                            <li>這份教材包含 4 個長度不等的故事，用來探討 4 種不同的潛在霸凌情境及霸凌者需求。</li>
                            <li>每則故事都含有影片、教學簡報、學習單以及線上計分系統供老師使用。</li>
                            <li>目前僅須購買 1 次註冊碼，即可使用網站上全部 4 個故事的內容。</li>
                            <li>若往後推出新故事會依情況再考慮是否加收費用。</li>
                            <li>本網站預計自 2024 年運營至 2028 年底，如有調整將事先於網站公告或以電子郵件通知會員。</li>
                        </ul>
                        關於退費
                        <ul>
                            <li>未使用註冊碼前申請，可全額退費。</li>
                            <li>使用註冊碼後的 7 日內申請，可全額退費。</li>
                            <li>使用註冊碼後超過 8 日（含）申請，恕不退費。</li>
                            <li>上述時間點將以系統內顯示的註冊碼被使用時間為依據。</li>
                            <li>若需要退費，請來信阿普蛙官方信箱 wasupstudio@gmail.com，並於標題註明「反霸凌教材退費申請」，將有專人為您處理。</li>
                        </ul>
                    </el-collapse-item>
                </el-collapse>
            </div>  
        </div>
    </NuxtLayout>
</template>

<script setup>
const activeNames = ref(['1', '2', '3','4','5','6','7','8','9','10','11','12'])
const handleChange = (val) => {
    console.log(val)
}
</script>

<style lang="scss" scoped>
ul {
    margin-left: 20px;
}

.box {
    display: flex;
    width: 100%;
    background-color: $background1;
    align-items: center;
    justify-content: center;
    flex-direction: column;

    .title {
        margin-bottom: 32px;
        font-weight: 700;
        font-size: 32px;
        letter-spacing: 1.5px;
        color: $text1;
        display: flex;
        justify-content: center;
        margin-top: 32px;
    }

    .collapse {
        width: 60%;
        background-color: $background1;
        font-size: 22px;
        @include respond-to("phone") {
            width: 90%;
        }
    }

    .collapse :deep(.el-collapse-item__header),
    .collapse :deep(.el-collapse-item__content) {
        background-color: $background1;
        font-size: 16px;
    }




}
</style>